# Software installed on a fresh machine. Edit freely — this is the source of
# truth for everything Homebrew manages. Regenerate from a configured machine
# with `brew bundle dump --describe`.

tap "hashicorp/tap"
tap "withgraphite/tap"

# CLI tools
brew "git"
brew "gh"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "bat"
brew "eza"
brew "tree"
brew "wget"
brew "tmux"

# Runtimes / version management
brew "asdf"
brew "go"

# Dev tools
brew "hashicorp/tap/terraform"
brew "withgraphite/tap/graphite"

# Commit signing
brew "gnupg"
brew "pinentry-mac"

# Tooling for this repo's own checks
brew "pre-commit"
brew "shellcheck"
brew "shfmt"
brew "gitleaks"
brew "bats-core"

# Applications
cask "1password"
cask "brave-browser"
cask "visual-studio-code"
cask "iterm2"
cask "rectangle"
