# Software installed on a fresh machine. Edit freely — this is the source of
# truth for everything Homebrew manages. Regenerate from a configured machine
# with `brew bundle dump --describe`.

# CLI tools
brew "git"
brew "gh"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "bat"
brew "eza"
brew "tree"
brew "wget"
brew "tmux"

# Shell
brew "starship"

# Runtimes / version management
brew "asdf"

# Tooling for this repo's own checks
brew "pre-commit"
brew "shellcheck"
brew "shfmt"
brew "gitleaks"
brew "bats-core"

# Applications
cask "1password"
cask "google-chrome"
cask "visual-studio-code"
cask "iterm2"
cask "rectangle"
